add virtual USB drive support.
